# Inspired by SigmaHQ rule: https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_base64_execution.yml

title: Linux Base64 Encoded Pipe to Shell
id: 201
status: test
description: "Detects suspicious shell commands that use base64 encoded input piped to a shell for execution"
references:
    - https://github.com/arget13/DDexec
    - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
author: pH-T (Nextron Systems)
date: 2022-07-26
modified: 2023-06-16
tags:
    - attack.defense-evasion
    - attack.t1140
logsource:
    product: linux
    category: process_creation
action: "BLOCK_KILL_PROCESS"
events:
    - EXEC
detection:
    selection_base64:
        target.process.shell_command|contains: "base64 "
    selection_shell_pipe:
        - target.process.shell_command|contains:
            - "| bash "
            - "| sh "
            - "|bash "
            - "|sh "
        - target.process.shell_command|endswith:
            - " |sh"
            - "| bash"
            - "| sh"
            - "|bash"
    condition: all of selection*
falsepositives:
    - Legitimate administration activities
level: medium
