# Inspired by SigmaHQ rule: https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_security_tools_disabling.yml

title: Disabling Security Tools
id: 200
status: test
description: "Detects attempts to disable security tools such as firewalls, SELinux, and EDR agents"
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
author: Ömer Günal, Alejandro Ortuno, oscd.community
date: 2020-06-17
modified: 2022-10-09
tags:
    - attack.defense-evasion
    - attack.t1562.004
logsource:
    category: process_creation
    product: linux
action: "BLOCK_KILL_PROCESS"
events:
    - EXEC
detection:
    selection_iptables_stop:
        target.process.file.path|endswith: "/service"
        target.process.cmd|contains|all:
            - "iptables"
            - "stop"
    selection_firewall_stop:
        target.process.file.path|endswith: "/systemctl"
        target.process.cmd|contains|all:
            - "firewalld"
            - "stop"
    selection_firewall_disable:
        target.process.file.path|endswith: "/systemctl"
        target.process.cmd|contains|all:
            - "firewalld"
            - "disable"
    selection_selinux:
        target.process.file.path|endswith: "/setenforce"
        target.process.cmd|contains: "0"
    selection_crowdstrike:
        target.process.file.path|endswith: "/systemctl"
        target.process.cmd|contains|all:
            - "falcon-sensor"
            - "stop"
    selection_carbonblack:
        target.process.file.path|endswith: "/systemctl"
        target.process.cmd|contains|all:
            - "cbdaemon"
            - "stop"
    condition: 1 of selection*
falsepositives:
    - Legitimate administration activities
level: medium
