# Inspired by SigmaHQ rule: https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_history_delete.yml

title: History File Deletion
id: 204
status: test
description: "Detects deletion of shell history files used to remove traces of malicious activity"
references:
    - https://github.com/sleventyeleven/linuxprivchecker/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
author: Florian Roth (Nextron Systems)
date: 2022-06-20
modified: 2022-09-15
tags:
    - attack.impact
    - attack.t1565.001
logsource:
    category: process_creation
    product: linux
action: "BLOCK_EVENT"
events:
    - UNLINK
detection:
    selection_tool:
        process.file.filename:
            - "rm"
            - "unlink"
            - "shred"
    selection_history:
        - target.file.path|contains:
            - "/.bash_history"
            - "/.zsh_history"
        - target.file.filename|endswith:
            - "_history"
            - ".history"
            - "zhistory"
    condition: all of selection*
falsepositives:
    - Legitimate administration activities
level: high
